denote/20221119T014335--new-job__essay.org
#+title:      2022-11入社エントリ
#+date:       [2022-11-19 Sat 01:43]
#+filetags:   :essay:
#+identifier: 20221119T014335

* 入社エントリ
:LOGBOOK:
CLOCK: [2022-11-20 Sun 10:34]--[2022-11-20 Sun 10:59] =>  0:25
:END:

11月に入社して3週間経ったので書く。

職探しの経緯。[[id:7cacbaa3-3995-41cf-8b72-58d6e07468b1][Go]]で職を探した。静的型付言語で書かれたソフトウェアを読み書きできるようになりたかったのと、より技術にフォーカスしたオタクが多そうなイメージからだ。[[id:e04aa1a3-509c-45b2-ac64-53d69c961214][Rails]]はビジネス優先傾向が強い。動的型付言語から静的に移るのは難しいので、早い段階で業務経験を積まないと可能性を狭める[fn:1]という切実な理由もあった。

決め手になったのは事業が「なんか面白そう」という雑な理由だったが、この賭けには自分でも驚くほど勝ったように見える。自覚してなかった、自分が求めていたことを満たしていた。

- コンピュータ科学の素養がある、非常に優秀な人々がたくさんいる
- 研究室的なノリ。企業というかコミュニティが近い
- 静かなオフィス。プログラマーの割合が高いので、社内での電話がない
- 開発マシンに[[id:7a81eb7c-8e2b-400a-b01a-8fa597ea527a][Linux]]が使える。何人か使ってる人がいる

リモートワーク自由だったので活用しようと思っていたが、あまりの居心地のよさ、知的刺激に毎日出社している。前職でも週1出社だったが、それ以上行こうとは全く思ってなかった。職場が十分に魅力的であれば、人はリアルで集まるものなのだ。

[fn:1]新しめの言語の求人の多くは、その言語自体の経験を求めていないが、「静的型付言語での経験」の条件を示しているところが多い。
