denote/20221119T014335--new-job__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-03-20 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2022-11入社エントリ</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">2022-11入社エントリ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8391d54">入社エントリ</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8391d54" class="outline-2">
<h2 id="org8391d54"><a href="#org8391d54">入社エントリ</a></h2>
<div class="outline-text-2" id="text-org8391d54">
<p>
11月に入社して3週間経ったので書く。
</p>

<p>
職探しの経緯。<a href="../20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>で職を探した。静的型付言語で書かれたソフトウェアを読み書きできるようになりたかったのと、より技術にフォーカスしたオタクが多そうなイメージからだ。<a href="../20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>はビジネス優先傾向が強い。動的型付言語から静的に移るのは難しいので、早い段階で業務経験を積まないと可能性を狭める<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>という切実な理由もあった。
</p>

<p>
決め手になったのは事業が「なんか面白そう」という雑な理由だったが、この賭けには自分でも驚くほど勝ったように見える。自覚してなかった、自分が求めていたことを満たしていた。
</p>

<ul class="org-ul">
<li>コンピュータ科学の素養がある、非常に優秀な人々がたくさんいる</li>
<li>研究室的なノリ。企業というかコミュニティが近い</li>
<li>静かなオフィス。プログラマーの割合が高いので、社内での電話がない</li>
<li>開発マシンに<a href="../20220108110637-linux.html#ID-7a81eb7c-8e2b-400a-b01a-8fa597ea527a">Linux</a>が使える。何人か使ってる人がいる</li>
</ul>

<p>
リモートワーク自由だったので活用しようと思っていたが、あまりの居心地のよさ、知的刺激に毎日出社している。前職でも週1出社だったが、それ以上行こうとは全く思ってなかった。職場が十分に魅力的であれば、人はリアルで集まるものなのだ。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
新しめの言語の求人の多くは、その言語自体の経験を求めていないが、「静的型付言語での経験」の条件を示しているところが多い。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
